fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОканчанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ВКМ_Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеРаботы/ВКМ_ВыполненныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставлена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <comment>Дата начала  абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <comment>Дата окончания абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Стоимость часа работы специалиста</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Организация) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Организация"; 
		Сообщение.Текст = "Не выбана организация!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕСли; 
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Контрагент"; 
		Сообщение.Текст = "Не выбран контрагент!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕСли;
	

	Если НЕ ЗначениеЗаполнено(Договор) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Договор"; 
		Сообщение.Текст = "Не выбран договор!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕСли;	
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Ответственный"; 
		Сообщение.Текст = "Не выбран  специалист!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаПроведенияРабот) Тогда   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ДатаПроведенияРабот"; 
		Сообщение.Текст = "Не указана  дата проведения работ!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕСли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧаса,
	|	ДоговорыКонтрагентов.Представление КАК Представление,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействия КАК НачалоДействия,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия КАК ОкончаниеДействия,
	|	ДоговорыКонтрагентов.ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		
		Если НЕ Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Выбран договор с видом %1. Выберите договор абонентсого обслуживания.",
																Выборка.ВидДоговора);
			Сообщение.Сообщить();
			Возврат;	
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Выборка.НачалоДействия) ИЛИ 
				НЕ ЗначениеЗаполнено(Выборка.ОкончаниеДействия) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В договоре не заполнен период действия";
			Сообщение.Сообщить();				
		КонецЕсли;		
		
		Если Выборка.СтоимостьЧаса = 0 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("У договора %1 не указана стоимость часа работы", Выборка.Представление);
			Сообщение.Сообщить();
		КонецЕсли;	
			
		СуммаДокумента = ВыполненныеРаботы.Итог("ЧасыКОплате")*Выборка.СтоимостьЧаса;
	КонецЕсли;	
	
	//Для передачи данных в Телеграм
	ЭтоНовыйДокумент = Ложь; 
	ЭтоИзмененияДокумента = Ложь;
	СтарыеДанные = Новый Структура;
	
	ПолучитьДанныеОИзменениях(ЭтоНовыйДокумент, ЭтоИзмененияДокумента, СтарыеДанные );	
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйДокумент", ЭтоНовыйДокумент);
	ДополнительныеСвойства.Вставить("ЭтоИзмененияДокумента", ЭтоИзмененияДокумента);
	ДополнительныеСвойства.Вставить("СтарыеДанные", СтарыеДанные);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен клиент!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕСли;	
		
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен договор клиента!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕСли;	
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	               |	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаРаботСотрудника,
	               |	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплате) КАК ЧасовКОплате,
	               |	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Ответственный КАК Сотрудник,
	               |	ДоговорыКонтрагентов.ВКМ_НачалоДействия КАК НачалоДействия,
	               |	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия КАК ОкончаниеДействия,
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботыДляКлиента,
	               |	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Ответственный = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Ответственный,
	               |	ДоговорыКонтрагентов.ВКМ_НачалоДействия,
	               |	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия,
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы,
	               |	ДоговорыКонтрагентов.ВидДоговора,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
	               |	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы, 0)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ДатаДокумента", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Если Выборка.Следующий() Тогда
  
		
		Если Выборка.ПроцентОтРабот = NULL Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У сотрудника %1 не установлен процент оплаты от работ.", Выборка.Сотрудник);
			Отказ = истина;
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
		
		Если Выборка.СтоимостьЧасаРаботСотрудника = 0 Тогда
			 Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У договора %1 не установлена стоимость часа работ.", Договор);
			Отказ = истина;
			Сообщение.Сообщить();
			Возврат;
		КонецЕСли;	
		
		
		Если НЕ Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Выбран договор с видом %1. Выберите договор абонентсого обслуживания.",
																Выборка.ВидДоговора);
			Сообщение.Сообщить();
			Возврат;	
		КонецЕсли;	
		
		
		Если НЕ ЗначениеЗаполнено(Выборка.НачалоДействия) ИЛИ 
				НЕ ЗначениеЗаполнено(Выборка.ОкончаниеДействия) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В договоре не заполнен период действия";
			Сообщение.Сообщить();				
		КонецЕсли;			
		
		Если НЕ ЗначениеЗаполнено(Выборка.СтоимостьЧасаРаботыДляКлиента) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В договоре не заполнена стоимость часа работы";
			Сообщение.Сообщить();				
		КонецЕсли;			
		
		Если Дата < Выборка.НачалоДействия ИЛИ Дата > Выборка.ОкончаниеДействия Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Договор %1 дейстувует с %2 по %3. Дата документа не входит в этот промежуток.",
																Договор, Выборка.НачалоДействия, Выборка.ОкончаниеДействия);
			Сообщение.Сообщить();
		КонецЕсли;
		
		//В общем случае работы, не могут быть проведены ранее даты начала действия договора,
		//но возможны ситуации, когда фактически работы по договоору выполнены после окончания его действия,
		//например, если клиент с проблемой обратился в сроки действия (Дата документа), но не было свободных специалистов 
		Если ДатаПроведенияРабот < Выборка.НачалоДействия  Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Договор %1 дейстувует с %2. Работы не могут быть проведены ранее.",
																Договор, Выборка.НачалоДействия);
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		СуммаДокумента = Выборка.СтоимостьЧасаРаботыДляКлиента*ВыполненныеРаботы.Итог("ЧасыКОплате");
		
		
		ПроведенияПоРегиструВыполненныеРаботыСотрудника(Выборка);
		ПроведениеПоРегиструВыполненныеРаботы(Выборка);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ЗаписатьСообщениеДляТелеграмБота();  
	
	КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроведенияПоРегиструВыполненныеРаботыСотрудника(Выборка)        
	    			
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = ДатаПроведенияРабот;
		Движение.Сотрудник = Ответственный;
		Движение.ЧасовКОплате = Выборка.ЧасовКОплате; 
		
		СуммаКОплатеСотруднику = Выборка.СтоимостьЧасаРаботСотрудника*Выборка.ЧасовКОплате*Выборка.ПроцентОтРабот/100;
		
		Движение.СуммаОплаты = СуммаКОплатеСотруднику; 
		
			
КонецПроцедуры	

Процедура ПроведениеПоРегиструВыполненныеРаботы(Выборка)   

	// регистр ВКМ_ВыполненныеРаботы
	Движения.ВКМ_ВыполненныеРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеРаботы.Добавить();
	Движение.Период = ДатаПроведенияРабот;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплате");
	Движение.СуммаКОплате = СуммаДокумента;
	
КонецПроцедуры	


Процедура ЗаписатьСообщениеДляТелеграмБота()
	
	
	ЭтоНовыйДокумент = ДополнительныеСвойства.ЭтоНовыйДокумент;
	ЭтоИзмененияДокумента = ДополнительныеСвойства.ЭтоИзмененияДокумента;
		
	Если НЕ ЭтоНовыйДокумент И НЕ ЭтоИзмененияДокумента Тогда
		ДополнительныеСвойства.Удалить("ЭтоНовыйДокумент"); 
		ДополнительныеСвойства.Удалить("ЭтоИзмененияДокумента"); 
		Возврат;
	КонецЕСли;
	
	ТекстСообщения = "";
	
	НомерБезНулей = СократитьНули(Номер); 
	Если ЭтоНовыйДокумент Тогда
		Заголовок = СтрШаблон("<i>НОВАЯ заявка №%1</i> на обслуживание клиента %2%3", НомерБезНулей,  Контрагент, Символы.ПС);  
	КонецЕсли;	
	
	СтрСпц = "";
	СтрДата = "";
	СтрВремя = "";
	
	Если  ЭтоИзмененияДокумента Тогда
		СтарыеДанныеСпециалист = ДополнительныеСвойства.СтарыеДанные.Ответственный;
		СтарыеДанныеДата = ДополнительныеСвойства.СтарыеДанные.ДатаПроведенияРабот;
		СтарыеДанныеВремяНачала = ДополнительныеСвойства.СтарыеДанные.ВремяНачалаРаботПлан;
		СтарыеДанныеВремяОкончания = ДополнительныеСвойства.СтарыеДанные.ВремяОканчанияРаботПлан;
		
		Если ПометкаУдаления И ДополнительныеСвойства.СтарыеДанные.ПометкаУдаления <> ПометкаУдаления  Тогда    
			Заголовок = СтрШаблон("<b>ВНИМАНИЕ! Отменена заявка №%1</b> на обслуживание клиента %2%3", НомерБезНулей, Контрагент, Символы.ПС);
		Иначе
			Заголовок = СтрШаблон("<b>ВНИМАНИЕ! ИЗМЕНЕНИЕ заявки №%1</b> на обслуживание клиента %2%3", НомерБезНулей, Контрагент, Символы.ПС);
		КонецЕсли;	
			
				
		Если СтарыеДанныеСпециалист <> Ответственный Тогда
			СтрСпц = СтрШаблон("<s>%1</s> ", СтарыеДанныеСпециалист);
		КонецЕСли;	
		
		Если СтарыеДанныеДата <> ДатаПроведенияРабот Тогда
			СтрДата = СтрШаблон("<s>%1</s> ", Формат(СтарыеДанныеДата, "ДФ=dd.MM.yy;"));
		КонецЕСли;	
		
		Если СтарыеДанныеВремяНачала <> ВремяНачалаРаботПлан ИЛИ СтарыеДанныеВремяОкончания <> ВремяОканчанияРаботПлан Тогда
			СтрВремя = СтрШаблон("<s> с %1 до %2</s>",СтрокаВремени(СтарыеДанныеВремяНачала), СтрокаВремени(СтарыеДанныеВремяОкончания));
		КонецЕСли;	
		
		ДополнительныеСвойства.Удалить("СтарыеДанные");
	КонецЕсли;
	
	СпециалистТекст = СтрШаблон(" <blockquote>	Специалист: %1%2%3", СтрСпц ,Ответственный, Символы.ПС);
	ДатаТекст = СтрШаблон("	Дата:  %1%2%3",СтрДата ,Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yy;"), Символы.ПС);
	СтрокаВремя = СтрШаблон("Время: %1 с %2 по %3</blockquote>", СтрВремя ,СтрокаВремени(ВремяНачалаРаботПлан),СтрокаВремени(ВремяОканчанияРаботПлан));
	
	ТекстСообщения = СтрШаблон("%1 %2 %3 %4 ", Заголовок, СпециалистТекст, ДатаТекст, СтрокаВремя);
	
	НовоеУведомление = Справочники.ВКМ_Уведомления.СоздатьЭлемент();
	НовоеУведомление.ТекстСообщения = ТекстСообщения;
	НовоеУведомление.Записать();
	 
	ДополнительныеСвойства.Удалить("ЭтоНовыйДокумент"); 
	ДополнительныеСвойства.Удалить("ЭтоИзмененияДокумента");  
КонецПроцедуры

Функция СократитьНули(Строка)
	
	КолвоЗнаков = СтрДлина(Строка);
	ЧислоНулей = 0;
	
	Для i = 1 по КолвоЗнаков Цикл
		Символ = Сред(Строка, i, 1);
		Если Символ = "0" Тогда
			ЧислоНулей = ЧислоНулей + 1;
		Иначе
			Прервать;
		КонецЕсли;	
			
	КонецЦикла;	 
	НоваяСтрока = Прав(Строка, КолвоЗнаков-ЧислоНулей);
	
	Возврат НоваяСтрока;
КонецФункции	 
	
Процедура ПолучитьДанныеОИзменениях(ЭтоНовыйДокумент, ЭтоИзмененияДокумента, СтарыеДанные)
		
	//Документ записывается впервые 
	Если Не ЗначениеЗаполнено(Ссылка) Тогда  
    	ЭтоНовыйДокумент = Истина;  
	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВКМ_ОбслуживаниеКлиента.Ответственный КАК Ответственный,
		               |	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		               |	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
		               |	ВКМ_ОбслуживаниеКлиента.ВремяОканчанияРаботПлан КАК ВремяОканчанияРаботПлан,
		               |	ВКМ_ОбслуживаниеКлиента.ПометкаУдаления КАК ПометкаУдаления
		               |ИЗ
		               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		               |ГДЕ
		               |	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЕСли Выборка.Следующий()  Тогда
			Если НЕ ДатаПроведенияРабот = Выборка.ДатаПроведенияРабот ИЛИ
				 НЕ ВремяНачалаРаботПлан = Выборка.ВремяНачалаРаботПлан ИЛИ
				 НЕ ВремяОканчанияРаботПлан = Выборка.ВремяОканчанияРаботПлан ИЛИ
				 НЕ Ответственный = Выборка.Ответственный ИЛИ
				 НЕ ПометкаУдаления = Выборка.ПометкаУдаления Тогда
				 
				 ЭтоИзмененияДокумента = Истина;
				 
				 СтарыеДанные.Вставить("Ответственный", Выборка.Ответственный);
				 СтарыеДанные.Вставить("ДатаПроведенияРабот", Выборка.ДатаПроведенияРабот);
				 СтарыеДанные.Вставить("ВремяНачалаРаботПлан", Выборка.ВремяНачалаРаботПлан);
				 СтарыеДанные.Вставить("ВремяОканчанияРаботПлан", Выборка.ВремяОканчанияРаботПлан);
				 
				 СтарыеДанные.Вставить("ПометкаУдаления", Выборка.ПометкаУдаления);
			КонецЕСли;
		КонецЕСли;	
			 	
	КонецЕсли; 
	
КонецПроцедуры	

Функция СтрокаВремени(Время)	
	Возврат Лев(Формат(Время,"ДЛФ=T; ДП=00:00"), 5);
КонецФункции			
	
#КонецОбласти

#КонецЕсли
